# Напишите программу, которая принимает на вход координаты 
# двух точек и находит расстояние между ними в 2D пространстве.
# Пример: A (3, 6); B (2, 1) -> 5,09   A (7,-5); B (1,-1) -> 7,21

print('Введите координату х1: ')
x1 = int(input())
print('Введите координату y1: ')
y1 = int(input())
print('Введите координату х2: ')
x2 = int(input())
print('Введите координату y2: ')
y2 = int(input())
A = (x1, y1)
B = (x2, y2)
length = round(((x2-x1)**2+(y2-y1)**2) ** (0.5), 2)
print('A =', A,';','B =', B, '->', length)